In [1]:
import numpy as np

In [2]:
import pandas as pd

In [3]:
from pandas import Series, DataFrame

In [4]:
df = DataFrame({'key1': ['a', 'a', 'b', 'b', 'a'],
               'key2': ['one', 'two', 'one', 'two', 'one'],
               'data1': np.random.randn(5),
               'data2': np.random.randn(5)})

In [5]:
df

      data1     data2 key1 key2
0  1.019215  0.495233    a  one
1  2.111476 -1.481698    a  two
2  0.061709  0.548076    b  one
3 -1.853499  1.307573    b  two
4  0.048840 -0.937888    a  one

In [6]:
grouped = df['data1'].groupby(df['key1'])

In [7]:
grouped

In [8]:
grouped.mean()

key1
a    1.059844
b   -0.895895
Name: data1, dtype: float64

In [9]:
df['key1']

0    a
1    a
2    b
3    b
4    a
Name: key1, dtype: object

In [10]:
df['data1'].groupby([df['key1'], df['key2']]).mean()

key1  key2
a     one     0.534028
      two     2.111476
b     one     0.061709
      two    -1.853499
Name: data1, dtype: float64

In [11]:
states= np.array(['Ohio', 'California', 'California', 'Ohio', 'Ohio'])

In [12]:
df['data1'].groupby(states).mean()

California    1.086592
Ohio         -0.261815
Name: data1, dtype: float64

In [13]:
df.groupby('key1').mean()

         data1     data2
key1
a     1.059844 -0.641451
b    -0.895895  0.927825

In [14]:
for name, group in df.groupby('key1'):
    print(name)
    print(group)

a
      data1     data2 key1 key2
0  1.019215  0.495233    a  one
1  2.111476 -1.481698    a  two
4  0.048840 -0.937888    a  one
b
      data1     data2 key1 key2
2  0.061709  0.548076    b  one
3 -1.853499  1.307573    b  two

In [15]:
pieces = dict(list(df.groupby('key1')))

In [16]:
pieces

{'a':       data1     data2 key1 key2
 0  1.019215  0.495233    a  one
 1  2.111476 -1.481698    a  two
 4  0.048840 -0.937888    a  one, 'b':       data1     data2 key1 key2
 2  0.061709  0.548076    b  one
 3 -1.853499  1.307573    b  two}

In [17]:
list(df.groupby('key1'))

[('a',       data1     data2 key1 key2
  0  1.019215  0.495233    a  one
  1  2.111476 -1.481698    a  two
  4  0.048840 -0.937888    a  one), ('b',       data1     data2 key1 key2
  2  0.061709  0.548076    b  one
  3 -1.853499  1.307573    b  two)]

In [18]:
df.dtypes

data1    float64
data2    float64
key1      object
key2      object
dtype: object

In [20]:
group

      data1     data2 key1 key2
2  0.061709  0.548076    b  one
3 -1.853499  1.307573    b  two

In [21]:
df

      data1     data2 key1 key2
0  1.019215  0.495233    a  one
1  2.111476 -1.481698    a  two
2  0.061709  0.548076    b  one
3 -1.853499  1.307573    b  two
4  0.048840 -0.937888    a  one

In [23]:
df.groupby('key1')['data1'].mean()

key1
a    1.059844
b   -0.895895
Name: data1, dtype: float64

In [24]:
people = DataFrame(np.random.randn(5, 5),
                  columns=['a', 'b', 'c', 'd', 'e'],
                  index=['Joe', 'Steve', 'Wes', 'Jim', 'Travis'])

In [25]:
people

               a         b         c         d         e
Joe     1.153836 -1.034684 -1.124036  1.888313  0.352589
Steve  -0.607263 -0.588185  0.757872  0.750331  0.565383
Wes    -2.326797  0.070438  0.129184  0.462859 -0.246272
Jim     1.269154 -0.951234 -1.477744 -0.388392  1.994833
Travis -1.141120 -0.936496  0.053811  1.353003  1.606320

In [36]:
people.iloc[2:3, 1:3] = np.nan

In [37]:
people

               a         b         c         d         e
Joe     1.153836 -1.034684 -1.124036  1.888313  0.352589
Steve  -0.607263 -0.588185  0.757872  0.750331  0.565383
Wes    -2.326797       NaN       NaN  0.462859 -0.246272
Jim     1.269154 -0.951234 -1.477744 -0.388392  1.994833
Travis -1.141120 -0.936496  0.053811  1.353003  1.606320

In [38]:
mapping = {'a': 'red', 'b': 'red', 'c': 'blue', 'd': 'blue', 'e': 'red', 'f': 'orange'}

In [41]:
by_column = people.groupby(mapping, axis=1)

In [42]:
by_column.sum()

            blue       red
Joe     0.764277  0.471741
Steve   1.508203 -0.630066
Wes     0.462859 -2.573069
Jim    -1.866137  2.312753
Travis  1.406813 -0.471296

In [43]:
people.groupby(len).sum()

          a         b         c         d         e
3  0.096193 -1.985918 -2.601780  1.962780  2.101150
5 -0.607263 -0.588185  0.757872  0.750331  0.565383
6 -1.141120 -0.936496  0.053811  1.353003  1.606320

In [44]:
key_list = ['one', 'one', 'one', 'two', 'two']

In [45]:
people.groupby([len, key_list]).min()

              a         b         c         d         e
3 one -2.326797 -1.034684 -1.124036  0.462859 -0.246272
  two  1.269154 -0.951234 -1.477744 -0.388392  1.994833
5 one -0.607263 -0.588185  0.757872  0.750331  0.565383
6 two -1.141120 -0.936496  0.053811  1.353003  1.606320